[
  {
    "quote": "Actions are judged by intentions.",
    "reference": "Narrated by Umar ibn Al-Khattab (radiyallahu anhu). Sahih Bukhari, Vol. 1, Book 1, Hadith 1"
  },
  {
    "quote": "The best among you are those who have the best manners and character.",
    "reference": "Narrated by Aisha (radiyallahu anha). Sahih Bukhari, Vol. 8, Book 73, Hadith 56"
  },
  {
    "quote": "None of you truly believes until he loves for his brother what he loves for himself.",
    "reference": "Narrated by Anas ibn Malik (radiyallahu anhu). Sahih Bukhari, Vol. 1, Book 2, Hadith 12"
  },
  {
    "quote": "Do not speak ill of the dead, for they have reached the consequences of their actions.",
    "reference": "Narrated by Abu Hurairah (radiyallahu anhu). Sunan Abu Dawood, Book 41, Hadith 4856"
  },
  {
    "quote": "The strong is not the one who overcomes the people by his strength, but the strong is the one who controls himself while in anger.",
    "reference": "Narrated by Sahel ibn Saad (radiyallahu anhu). Sahih Bukhari, Vol. 8, Book 73, Hadith 135"
  },
  {
    "quote": "A Muslim is the one from whose tongue and hands others are safe.",
    "reference": "Narrated by Sahel ibn Saad (radiyallahu anhu). Sahih Bukhari, Vol. 1, Book 2, Hadith 10"
  },
  {
    "quote": "The best of charity is that which is given by a wealthy person (from his surplus wealth) to another wealthy person.",
    "reference": "Narrated by Abu Hurairah (radiyallahu anhu). Sahih Bukhari, Vol. 2, Book 24, Hadith 507"
  },
  {
    "quote": "The most beloved deeds to Allah are those done consistently, even if they are small.",
    "reference": "Narrated by Aisha (radiyallahu anha). Sahih Bukhari, Vol. 8, Book 76, Hadith 472"
  },
  {
    "quote": "The believer does not slander, curse, or speak in an obscene or foul manner.",
    "reference": "Narrated by Abu Hurairah (radiyallahu anhu). Sunan Ibn Majah, Book 37, Hadith 3669"
  },
  {
    "quote": "The one who helps another in his time of need, Allah will help him in his time of need.",
    "reference": "Narrated by Abu Hurairah (radiyallahu anhu). Sunan Abu Dawood, Book 43, Hadith 4869"
  },
  {
    "quote": "The best of you are those who are best to their families.",
    "reference": "Sunan Ibn Majah, Vol. 1, Book 9, Hadith 1977"
  },
  {
    "quote": "Do not belittle any act of kindness, even the smallest, for it has great value in the sight of Allah.",
    "reference": "Sunan Ibn Majah, Vol. 1, Book 32, Hadith 4209"
  },
  {
    "quote": "The most beloved of people to Allah is the one who is most beneficial to people.",
    "reference": "Sahih At-Tirmidhi, Vol. 4, Book 10, Hadith 1956"
  },
  {
    "quote": "Avoid suspicion, for suspicion is the most deceitful of all lies.",
    "reference": "Sahih Bukhari, Vol. 8, Book 73, Hadith 6064"
  },
  {
    "quote": "Take advantage of five before five: your youth before old age, your health before sickness, your wealth before poverty, your free time before preoccupation, and your life before death.",
    "reference": "Al-Hakim, Vol. 4, Book 4, Hadith 7694"
  },
  {
    "quote": "Smiling in the face of your brother is an act of charity.",
    "reference": "Sunan At-Tirmidhi, Vol. 4, Book 14, Hadith 1956"
  },
  {
    "quote": "Verily, Allah does not look at your appearance or wealth, but He looks at your hearts and deeds.",
    "reference": "Sahih Muslim, Vol. 4, Book 32, Hadith 6221"
  },
  {
    "quote": "When you see a person who has been given more than you in wealth and beauty, look to those who have been given less.",
    "reference": "Sahih Muslim, Vol. 4, Book 42, Hadith 6600"
  },
  {
    "quote": "The most beloved prayer to Allah is the prayer performed on time.",
    "reference": "Musnad Ahmad, Vol. 6, Hadith 21883"
  },
  {
    "quote": "The best of you are those who learn the Quran and teach it to others.",
    "reference": "Sahih Bukhari, Vol. 6, Book 61, Hadith 5454"
  },
  {
    "quote": "Every person makes mistakes. The most blessed of those who make errors is he who repents.",
    "reference": "[Tirmidhi, Al-Qiyama (Judgement); 49]"
  },
  {
    "quote": "Those people who show no mercy will receive no mercy from Allah.",
    "reference": "[Muslim, Al-Fada’il (Excellent Qualities of the Prophet and His Companions); 66]"
  },
  {
    "quote": "Make things easier, do not make things more difficult, spread the glad tidings, do not hate.",
    "reference": "[Bukhari, Al-Ilm (Knowledge); 12]"
  },
  {
    "quote": "Those who are the means for good deeds are the same as those who perform good deeds.",
    "reference": "[Tirmidhi, Al-Ilm (Knowledge); 14]"
  },
  {
    "quote": "Who cheats us is not one of us.",
    "reference": "[Muslim, Al-Iman (Faith); 164]"
  },
  {
    "quote": "Allah is pleased with the task performed by you in which both the action and duty are sound and which is performed well.",
    "reference": "[Tabarani, Al-Mu’jam Al-Awsat; 1/275]"
  },
  {
    "quote": "You cannot enter heaven until you believe, and you will not truly believe until you (truly) love one another.",
    "reference": "[Muslim, Al-Iman (Faith); 93]"
  },
  {
    "quote": "I leave you two things. As long as you follow these, you will never go astray: Allah’s Book and the Sunnah of the Prophet.",
    "reference": "[Muwatta, Al-Qadr (Decree); 3]"
  }
]
